#+BEGIN: clocktable :maxlevel 2 :scope file
#+CAPTION: Clock summary at [2015-03-28 Sat 03:35]
| Headline                             | Time    |
|--------------------------------------+---------|
| *Total time*                         | *28:03* |
|--------------------------------------+---------|
| STARTED [#A] Assembler: hw 1 sprintf | 28:03   |
#+END:

* STARTED [#A] Assembler: hw 1 sprintf
  DEADLINE: <2015-03-15 Sun>
  :LOGBOOK:
  CLOCK: [2015-03-28 Sat 02:04]--[2015-03-28 Sat 03:34] =>  1:30
  CLOCK: [2015-03-28 Sat 01:23]--[2015-03-28 Sat 01:55] =>  0:32
  CLOCK: [2015-03-28 Sat 00:48]--[2015-03-28 Sat 01:15] =>  0:27
  CLOCK: [2015-03-27 Fri 22:29]--[2015-03-28 Sat 00:45] =>  2:16
  CLOCK: [2015-03-27 Fri 20:10]--[2015-03-27 Fri 21:49] =>  1:39
  CLOCK: [2015-03-27 Fri 18:58]--[2015-03-27 Fri 19:45] =>  0:47
  CLOCK: [2015-03-27 Fri 14:22]--[2015-03-27 Fri 14:35] =>  0:13
  CLOCK: [2015-03-27 Fri 12:42]--[2015-03-27 Fri 12:46] =>  0:04
  CLOCK: [2015-03-27 Fri 10:48]--[2015-03-27 Fri 12:07] =>  1:19
  CLOCK: [2015-03-25 Wed 19:40]--[2015-03-25 Wed 20:58] =>  1:18
  CLOCK: [2015-03-25 Wed 19:11]--[2015-03-25 Wed 19:32] =>  0:21
  CLOCK: [2015-03-25 Wed 15:52]--[2015-03-25 Wed 16:35] =>  0:43
  CLOCK: [2015-03-25 Wed 13:18]--[2015-03-25 Wed 13:33] =>  0:15
  CLOCK: [2015-03-25 Wed 10:51]--[2015-03-25 Wed 11:13] =>  0:22
  CLOCK: [2015-03-23 Mon 20:20]--[2015-03-23 Mon 21:23] =>  1:03
  CLOCK: [2015-03-23 Mon 20:03]--[2015-03-23 Mon 20:12] =>  0:09
  CLOCK: [2015-03-23 Mon 18:50]--[2015-03-23 Mon 19:09] =>  0:19
  CLOCK: [2015-03-23 Mon 14:55]--[2015-03-23 Mon 15:30] =>  0:35
  CLOCK: [2015-03-23 Mon 14:12]--[2015-03-23 Mon 14:20] =>  0:08
  CLOCK: [2015-03-23 Mon 12:29]--[2015-03-23 Mon 12:48] =>  0:19
  CLOCK: [2015-03-23 Mon 11:05]--[2015-03-23 Mon 11:07] =>  0:02
  CLOCK: [2015-03-23 Mon 11:01]--[2015-03-23 Mon 11:04] =>  0:03
  CLOCK: [2015-03-23 Mon 02:17]--[2015-03-23 Mon 02:32] =>  0:15
  CLOCK: [2015-03-22 Sun 15:24]--[2015-03-22 Sun 15:45] =>  0:21
  CLOCK: [2015-03-22 Sun 13:52]--[2015-03-22 Sun 14:33] =>  0:41
  CLOCK: [2015-03-22 Sun 12:27]--[2015-03-22 Sun 13:36] =>  1:09
  CLOCK: [2015-03-22 Sun 00:18]--[2015-03-22 Sun 00:38] =>  0:20
  CLOCK: [2015-03-21 Sat 22:26]--[2015-03-22 Sun 00:00] =>  1:34
  CLOCK: [2015-03-21 Sat 21:51]--[2015-03-21 Sat 22:17] =>  0:26
  CLOCK: [2015-03-21 Sat 20:59]--[2015-03-21 Sat 21:15] =>  0:16
  CLOCK: [2015-03-21 Sat 13:07]--[2015-03-21 Sat 13:30] =>  0:23
  CLOCK: [2015-03-21 Sat 11:04]--[2015-03-21 Sat 11:10] =>  0:06
  CLOCK: [2015-03-21 Sat 09:31]--[2015-03-21 Sat 10:00] =>  0:29
  CLOCK: [2015-03-21 Sat 08:55]--[2015-03-21 Sat 09:06] =>  0:11
  CLOCK: [2015-03-21 Sat 08:33]--[2015-03-21 Sat 08:46] =>  0:13
  CLOCK: [2015-03-15 Sun 20:27]--[2015-03-15 Sun 21:24] =>  0:57
  CLOCK: [2015-03-15 Sun 16:25]--[2015-03-15 Sun 17:47] =>  1:22
  CLOCK: [2015-03-15 Sun 13:26]--[2015-03-15 Sun 14:03] =>  0:37
  CLOCK: [2015-03-15 Sun 12:22]--[2015-03-15 Sun 12:45] =>  0:23
  CLOCK: [2015-03-15 Sun 10:48]--[2015-03-15 Sun 12:15] =>  1:27
  CLOCK: [2015-03-14 Sat 22:11]--[2015-03-14 Sat 22:25] =>  0:14
  CLOCK: [2015-03-14 Sat 20:38]--[2015-03-14 Sat 21:14] =>  0:36
  CLOCK: [2015-03-14 Sat 13:11]--[2015-03-14 Sat 13:45] =>  0:34
  CLOCK: [2015-03-14 Sat 03:38]--[2015-03-14 Sat 04:43] =>  1:05
  :END:
